<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><title>Plugin de Actividades</title>

<link rel="stylesheet" href="../estilo.css">
</head>

<body topmargin="0">
<table align="center" border="0" height="95" width="478">
<tbody>
<tr>
<td height="23">
<p class="Estilo4" align="left">Plugin de Vista Conjunta</p></td>
</tr>
<tr class="TextoNormal TextoNormal">
<td width="472" height="66"><p class="TextoNormal"><br>
  El plugin  de Vista Conjunta es la integraci&oacute;n de los diagramas de Estados y Diagrama de Actividades. Su finalidad es  poder utilizar los elementos de estos tres diagramas bajo un mismo espacio, destacando las posibles relaciones impl&iacute;citas que puedan existir entre sus respectivos elementos a la vez que expande su sem&aacute;ntica.</p>
  <p class="TextoNormal">Los elementos propios de este diagrama son: </p>
  <ul class="TextoNormal">
<li> Actividad (Actividad)</li>
<li> Objeto (Actividad) </li>
<li>Estado Inicial (Actividad) </li>
<li> Estado Final (Actividad)</li>
<li> Decisi&oacute;n (Actividad)</li>
<li> Barra de sincronización (Actividad)</li>
<li>Actor  (Secuencia) </li>
<li>Objeto (Secuencia) </li>
<li> Transición (Secuencia) </li>
<li>Transici&oacute;n C&iacute;clica (Secuencia) </li>
<li> Transici&oacute;n (Actividad) </li>
</ul>
  <p class="TextoResaltado" align="left">Creaci&oacute;n de un nuevo Diagrama de Vista Conjunta: </p>
  <p class="TextoNormal" align="left">Colosoft
    soporta el Plugin de Vista Conjunta mediante la creaci&oacute;n de un nuevo
    diagrama de Vista Conjunta. <br>
  <br>
    Para la creaci&oacute;n de un nuevo diagrama se selecciona en
    el Marco de Expresi&oacute;n: Nuevo, Ingeniero de Sistemas, Diagrama de
    Vista Conjunta.</p>
  <p class="TextoNormal" align="left">Se ingresan
    los datos correspondientes al diagrama.</p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><img src="nuevo.png" width="410" height="248"></p>
    <p>Figura 1. Creaci&oacute;n de un diagrama de vista conjunto</p>
  </div>
  <p class="TextoResaltado" align="left">Barra de
herramientas del Plugin Diagrama de Vista Conjunta: </p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><img src="barrageneral.png" width="359" height="21"></p>
    <p>Figura 2. Amplia barra de herramientas disponibles en el plugin</p>
  </div>
  <p align="justify"><span class="TextoNormal" style="font-weight: bold;">&nbsp;</span><span class="TextoResaltado" style="font-weight: bold;">Actividad:</span><span class="TextoNormal" style="font-weight: bold;">&nbsp;</span><span class="TextoNormal"> Para agregar una actividad se selecciona el icono Actividad. </span></p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><img src="Compuesta00.png" width="360" height="65"></p>
    <p>Figura 3. Creaci&oacute;n de una actividad</p>
  </div>
  <div class="TextoNormal" style="text-align: left;">
    <div align="justify"><br>
      Aparecerá la venta de &nbsp;creación de una
      actividad. El
      dato mínimo requerido para crear la actividad es un nombre
      diferente de "anonymus". Opcionalmente se pueden digitar los campos de
      Estereotipo, Autor y Versi&oacute;n. Es posible ajustar las propiedades del
      contenedor (visible y editable) junto con las propiedades del elemento
      de grafo. <br>
  <br>
  <br>
    </div>
  </div>
<div class="Imagen" style="text-align: center;">
  <p><span class="TextoNormal"> </span><img src="actividad2.gif" width="275" height="379"></p>
  <p>Figura 4. Datos para la creaci&oacute;n de una actividad</p>
</div>
<span class="TextoNormal" style="font-family: Arial,Helvetica,sans-serif;"></span>
<div class="TextoNormal" style="text-align: left;"><span class="TextoNormal"><br>
  El
elemento gráfico de actividad posee dos iconos
contextuales de expansi&oacute;n. El primero le permite crear una actividad
predecesora (una actividad que conduce a la actual) y el otro para una
actividad posterior a la actual. Adicionalmente posee el icono
para generar notas sobre la actividad que poseen todos los elementos
gráficos UML+ . Los elementos dentro de la actividad se organizan de
arriba hacia abajo en:<br>
<br>
</span>
  <ul>
<li class="TextoNormal">Estereotipo</li>
<li class="TextoNormal">Nombre del autor</li>
<li class="TextoNormal">Versi&oacute;n</li>
<li class="TextoNormal">Nombre de la actividad</li>
</ul>
<br>
<div class="Imagen" style="text-align: center;">
  <p><img src="actividad3.png" alt=""></p>
  <p>Figura 5. Representaci&oacute;n de la actividad  </p>
</div>
  <div class="TextoNormal">
    <p class="TextoNormal"><br>
      Al crear una nueva
      actividad de esta manera esta genera
  &nbsp;automáticamente una transición sin etiqueta a una
      nueva actividad vac&iacute;a "anonymus"</p>
  </div>
    <div class="Imagen" style="text-align: center;">
      <p><img src="actividad4.png" alt=""></p>
      <p>Figura 6. Creaci&oacute;n de una actividad a partir de una existente</p>
    </div>
<span class="TextoNormal" style="font-weight: bold;"><br>
Objeto:&nbsp;</span><span class="TextoNormal">Un
        objeto es la representaci&oacute;n concreta o abstracta de una clase. La
        creación de un objeto puede estar basada en una clase de un
        Diagrama de Clases que este abierto actualmente dentro del entorno de
        trabajo, de donde tomará los atributos y las operaciones. </span></div>
<div class="Imagen" style="text-align: center;">
  <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><img src="compuesta02.png" width="359" height="71"></p>
  <p class="TextoNormal">Figura 7. Bot&oacute;n de creaci&oacute;n de un objeto<br>
      <br>
  </p>
</div>
<div class="Imagen" style="text-align: center;">
  <p><img src="objeto1.png" alt="" width="396" height="273"></p>
  <p>Figura 8. Escogencia de la clase plantilla</p>
</div>
<br class="TextoNormal">
<span class="TextoNormal">La clase plantilla para el
objeto en el Diagrama de Vista Conjunta puede
ser tomada como fuente de características de tres maneras
diferentes, como Clase, Objeto o Combinado. Como clase el objeto en el
diagrama tomará los atributos y las operaciones de la clase
plantilla, mientras que como objeto solo generará la
asociación a ese tipo sin tomar sus atributos ni operaciones.&nbsp; </span><br>
<br class="TextoNormal">
<br class="TextoNormal">
<div class="Imagen" style="text-align: center;">
  <p><img src="objeto4.png" alt=""> </p>
  <p>Figura 9. Fuente de caracter&iacute;sticas del objeto</p>
</div>
<br class="TextoNormal">
<span class="TextoNormal">Si no se tiene una clase
plantilla desde un Diagrama de Clases, es
posible crear una nueva clase propia, que será contenida en un
Diagrama de Clases previamente creado. </span><br>
<br class="TextoNormal">
<br class="TextoNormal">
<div class="Imagen" style="text-align: center;">
  <p><img class="TextoNormal" src="objeto2.png" alt=""><span class="TextoNormal"> </span></p>
  <p>Figura 10. Escogencia de la clase plantilla<br class="TextoNormal">
    </p>
</div>
<br class="TextoNormal">
<span class="TextoNormal">Al hacer clic en editar se
abrirá una pantalla que contiene los
elementos para la creación de un a clase vistos en el Diagrama
de Clases . En éste se podrá generar todos los elementos
necesarios de la clase para que esta sea usada como plantilla para el
objeto en el Diagrama de Vista Conjunta sobre el que se esta generando
dicho elemento.</span><br class="TextoNormal">
<div class="Imagen" style="text-align: center;">
  <p><img src="objeto3.png" alt=""> </p>
  <p>Figura 11. Creaci&oacute;n de una nueva clase plantilla</p>
</div>
<span class="TextoNormal"><br class="TextoNormal">
<span style="font-weight: bold;">Estado
Inicial: </span>&nbsp;El
estado inicial es el punto del cual va a partir un diagrama de
actividades .Su icono de creación corresponde a un
círculo rojo que se encuentra en la barra espec&iacute;fica
del marco de Diagrama de Vista Conjunta. </span><br>
<br>
<div class="Imagen" style="text-align: center;">
  <p><img src="compuesta03.png" width="360" height="70"></p>
  <p>Figura 12. Creaci&oacute;n de un estado inicial</p>
</div>
<br>
<span class="TextoNormal">Al igual que con otros
elementos de este marco el dato m&iacute;nimo requerido
para generar el elemento de Estado Inicial es un nombre diferente de
anonymus. Adicional a &eacute;sta las propiedades comunes del contenedor y el
elemento gráfico.<br>
</span><br>
<div class="Imagen" style="text-align: center;">
  <p><img src="estadoIni2.png" alt="" width="417" height="367" style="width: 417px; height: 400px;"> </p>
  <p>Figura 13. Datos b&aacute;sicos para la creaci&oacute;n del estado inicial</p>
</div>
<br>
<span class="TextoNormal">Para el estado inicial es
posible generar un conjunto de actividades, transiciones y particiones
con las cuales esta asociado. </span><br class="TextoNormal">
<br class="TextoNormal">
<span class="TextoNormal" style="font-weight: bold;">Estado
Final: </span><span class="TextoNormal">&nbsp;Es el
estado en el cual un Diagrama de actividades que se esta trabajando
finaliza. Corresponde al circulo azul en la barra específica del
marco de actividades.</span><br>
<br>
<div class="Imagen" style="text-align: center;">
  <p><img src="compuesta04.png" width="359" height="81"></p>
  <p>Figura 14. Creaci&oacute;n de un estado final</p>
</div>
<span class="TextoNormal"><br>
Al igual que con los otros
elementos solo es necesario ajustar el nombre y opcionalmente al igual
que con Estado de Inicio, las actividades y transiciones asociadas a
este elemento.</span>
<p class="Imagen" style="text-align: center;"><img src="estadofin2.png" alt="" width="335" height="296"></p>
<p class="Imagen" style="text-align: center;">Figura 15. Ingreso de nombre del estado final</p>
<p class="Imagen" style="text-align: center;">&nbsp;</p>
<span class="TextoNormal" style="font-weight: bold;">Decisi&oacute;n: </span><span class="TextoNormal">Una
decisi&oacute;n permite generar una división en el flujo de
actividades de acuerdo a una cierta condici&oacute;n. El icono correspondiente
en la barra de específica del marco es el rectángulo rojo.<br> 
<br>
<br>
</span>
<div class="Imagen" style="text-align: center;">
  <p><img src="compuesta05.png" width="357" height="63"></p>
  <p>Figura 16. Creaci&oacute;n de una decisi&oacute;n</p>
</div>
<p class="TextoNormal">Los parámetros son iguales que
  para
  los otros elementos gráficos vistos, es decir un nombre
  diferente de anonymus y opcionalmente parámetros de actividades,
  transiciones y divisiones. Es propio de este elemento generar varias
  transiciones con tipos de guardas diferentes.</p>
<p><span class="TextoNormal">La
forma de generar transiciones desde y hacia una Decisi&oacute;n es igual a la
de otros elementos de este diagrama. Un ejemplo de como se deber&iacute;a
utilizar una decisi&oacute;n en coloso es la siguiente.
</span> </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="decision2.png" alt=""></p>
  <p>Figura 17. Decisi&oacute;n hacia tres nodos<br>
    </p>
</div>
<p><span class="TextoNormal" style="font-weight: bold;">Barra de Sincronizaci&oacute;n </span><br>
  <br class="TextoNormal">
  <span class="TextoNormal">Con
este subestado es posible &nbsp;reunir varias
transiciones&nbsp; y
canalizarlas hacia una sola. Para crear una barra de sincronizaci&oacute;n
&nbsp;se selecciona el icono correspondiente en la barra espec&iacute;fica
del
marco.<br>
<br>
  </span> </p>
<div class="Imagen" style="text-align: center;">
  <p><br>
      <img src="compuesta06.png" width="355" height="62"></p>
  <p>Figura 18. Creaci&oacute;n de la barra de sincronizaci&oacute;n</p>
</div>
<span class="TextoNormal"><br>
La
barra de sincronizaci&oacute;n permite la personalizaci&oacute;n de propiedades gr&aacute;ficos al momento de su
creaci&oacute;n y posteriormente:  color de contorno, fondo, sombreado y la
posici&oacute;n bien sea vertical u horizontal de la barra.<br>
<br>
</span>
<div class="Imagen" style="text-align: center;">
  <p><img src="barraSincronizacion2.png" alt="" width="407" height="235"></p>
  <p>Figura 19. Personalizaci&oacute;n de la barra de sincronizaci&oacute;n</p>
</div>
<p class="TextoNormal" align="left"><span class="TextoResaltado">Actor:</span> Un Actor genera eventos al
sistema y requiere como respuesta alguna operaci&oacute;n de este. El Actor
posee su l&iacute;nea de vida y esta asocaido a alguna clase como objeto,
Clase, o combinado de ambas.</p>
<p class="TextoNormal" align="left">Para crear un
  nuevo Actor se hace clic sobre el icono Actor y luego se hace clic
  sobre un espacio del diagrama.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="compuesta07.png" width="357" height="63"></p>
  <p>Figura 20. Creaci&oacute;n de un actor</p>
</div>
<p align="left" class="TextoNormal"><span class="TextoResaltado">Ventana
  de Especificaci&oacute;n de Actor: </span>en esta se puede cambiar el nombre del clasificador. Es posible
  relacionar al Actor con una clase, bien sea que esta exista en un
  Diagrama de Clases que se encuentre abierto dentro del proyecto,
  seleccionado una entrada de la lista desplegable Clase; o bien
  asociandolo a una calse nueva en un diagrama de clases existente,
  seleccionando "Nueva Clase", esto abrir&aacute; una ventana que permite
  especificar el nombre de una nueva clase y editarla con la ventana de
  especificaci&oacute;n de una Clase (<a href="../pluginClases/index.html">Ver
    Plugin de Clases</a>).</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia007.png" height="155" width="370"></p>
<p style="text-align: center;" class="Imagen">Figura 21. Atributos generales del actor</p>
<p class="TextoNormal" align="left">Seleccionada
  la clase relacionada con el Actor se escoje el tipo de asociaci&oacute;n
  Clase, Objeto o Combinado</p>
<p style="text-align: center;" class="Imagen"><img src="actor3.png" height="103" width="254"></p>
<p style="text-align: center;" class="Imagen">Figura 22. Fuente de caracter&iacute;sticas del actor</p>
<p class="TextoNormal" align="left">El Actor
  mostrar&aacute; en las siguientes pesta&ntilde;as de su ventana de especificaci&oacute;n los
  Atributos y Operaciones de la clase escogida, &nbsp;bien sea como
  Clase, Actor o ambos, asociaci&oacute;n que se escoge al momento de
  seleccionar o
  modificar la clase.</p>
<p class="TextoNormal" align="left">Los Atributos
  y Operaciones modificados o creados desde la especificaci&oacute;n del Actor,
  tambi&eacute;n repercutieron sobre las clase asociada, tenga cuidado de no
  da&ntilde;ar la sem&aacute;ntica deseada en el respectivo diagrama de clases.</p>
<p class="TextoNormal" align="left">El Actor
  reci&eacute;n creado luce como se muestra en la Figura 23.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia009.png" height="149" width="127"></p>
<p style="text-align: center;" class="Imagen">Figura 23. Representaci&oacute;n del actor</p>
<p align="left" class="TextoNormal"><span class="TextoResaltado">Objeto: </span>Aquellos que interact&uacute;an con
  el actor y entre ellos mediante el envio de mensajes y acciones, dentro
  de una secuencia determinada generalmente por un caso de uso. Los
  objetos son instancia de las clases que en alg&uacute;n momento participan de
  la interacci&oacute;n.</p>
<p class="TextoNormal" align="left">Para crear un
  nuevo Objeto se hace clic sobre el icono objeto y luego se hace clic
  sobre un espacio del diagrama.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="compuesta08.png" width="360" height="65"></p>
  <p>Figura 24. Creaci&oacute;n de un objeto</p>
</div>
<p class="Estilo11" align="justify">Aparece la
  ventana de especificaci&oacute;n del nuevo objeto, en esta se puede cambiar el
  nombre del clasificador. Es posible relacionar al Objeto con una clase,
  bien sea que esta exista en un Diagrama de Clases que se encuentre
  abierto dentro del proyecto, seleccionado una entrada de la lista
  desplegable Clase; o bien asociando una calse nueva a un diagrama de
  clases existente, seleccionando "Nueva Clase", esto abrir&aacute; una ventana
  que permite especificar el nombre de una nueva clase y editarla con la
  ventana de especificaci&oacute;n de una Clase (<a href="../pluginClases/index.html">Ver Plugin de Clases</a>).</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia007.png" height="155" width="370"></p>
<p style="text-align: center;" class="Imagen">Figura 25. Datos de creaci&oacute;n del objeto</p>
<p class="TextoNormal" align="left">Seleccionada
  la clase relacionada con el objeto, se escoge el tipo de asociaci&oacute;n
  Clase, Objeto o Combinado</p>
<p style="text-align: center;" class="Imagen"><img src="actor3.png" height="103" width="254"></p>
<p style="text-align: center;" class="Imagen">Figura 26. Fuente de caracter&iacute;sticas del objeto</p>
<p class="TextoNormal" align="left">El objeto
  mostrar&aacute; en las siguientes pesta&ntilde;as de su ventana de especificaci&oacute;n los
  Atributos y Operaciones de la clase escogida, &nbsp;bien sea como
  Clase, Objeto o ambos, asociaci&oacute;n que se escoge al momento de
  seleccionar o modificar la clase.</p>
<p class="TextoNormal" align="left">Los Atributos
  y Operaciones modificados o creados desde la especificaci&oacute;n del objeto,
  tambi&eacute;n repercutieron sobre las clase asociada, tenga cuidado de no
  da&ntilde;ar la sem&aacute;ntica deseada en el respectivo diagrama de clases.</p>
<p class="TextoNormal" align="left">El objeto
  reci&eacute;n creado luce como se muestra en la Figura 27.</p>
<p align="center" class="Imagen"><img src="secuencia012.png" height="224" width="120"></p>
<p align="center" class="Imagen">Figura 27. Representaci&oacute;n del objeto</p>
<p class="TextoNormal" align="left"><span class="TextoResaltado">Transiciones</span>: representan las
  interacciones entre los objetos, inician desde focos de control que son
  peque&ntilde;os rect&aacute;ngulos sobre las l&iacute;neas de vida, partiendo desde el
  objeto u actor de partida, hacia los foco de control sobre la l&iacute;nea de
  vida del objeto receptor. las transiciones pueden ser mensajes simples,
  tambi&eacute;n pueden ser mensajes de creaci&oacute;n o destrucci&oacute;n de objetos o
  pueden ser mensajes s&iacute;ncronos o as&iacute;ncronos, s&iacute;ncronos si hay o no una
  respuesta autom&aacute;tica al mensaje.</p>
<p class="TextoNormal" align="left">Para crear
  una nueva transici&oacute;n se hace clic en el icono transici&oacute;n y luego se
  hace clic sobre la l&iacute;nea de vida del objeto o actor que env&iacute;a la
  transici&oacute;n.</p>
<div class="Imagen" style="text-align: center;">
  <p><br>
      <img src="compuesta09.png" width="355" height="61"></p>
  <p>Figura 28. Creaci&oacute;n de una transici&oacute;n</p>
</div>
<p class="TextoNormal" align="left"> Luego se
  hace clic sobre la l&iacute;nea de vida del objeto receptor del mensaje. No es
  necesario alinear verticalmente la transici&oacute;n, despues de su
  especificaci&oacute;n esta ser&aacute; recta y a la altura del foco de partida.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia022.png" height="226" width="285"></p>
<p style="text-align: center;" class="Imagen">Figura 29. Transici&oacute;n entre actor e interfaz</p>
<p class="TextoNormal" align="left">Al crear gr&aacute;ficamente la transici&oacute;n, se muestra la ventana de especificaci&oacute;n de la transici&oacute;n, en esta se puede cambiar el
  nombre de la transici&oacute;n y el tipo del Retorno. Se especifica el tipo de
  la transici&oacute;n de entre Mensaje, Creaci&oacute;n y S&iacute;ncrono</p>
<p class="TextoNormal" align="left">Si el tipo
  seleccionado es de Creaci&oacute;n, el objeto receptor del mensaje iniciar&iacute;a
  su l&iacute;nea de vida en el foco de recepci&oacute;n de la transici&oacute;n. La cabeza de
  la flecha de la transici&oacute;n cambia de rellena a simple.</p>
<p class="TextoNormal" align="left">Si el mensaje
  es S&iacute;ncrono se espera un a respuesta autom&aacute;tica del Objeto Receptor.</p>
<p class="TextoNormal" align="left">Selecci&oacute;n
  Icono para mostrar un icono de la representaci&oacute;n de la visibilidad de
  la Transici&oacute;n.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia023.png" height="106" width="370"></p>
<p style="text-align: center;" class="Imagen">Figura 30. Operaciones de la transici&oacute;n</p>
<p class="TextoNormal" align="left">Haciendo clic
  en el bot&oacute;n msj/ret de puede establecer una respuesta al la transici&oacute;n
  que se esta creando. Escriba el nombre correspondiente y seleccione la
  casilla Visible.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia030.png" height="80" width="222"></p>
<p style="text-align: center;" class="Imagen">Figura 31. Ingreso del valor de retorno de la transici&oacute;n</p>
<p class="TextoNormal">Puede agregar o eliminar
  argumentos de la Transici&oacute;n, como tal la transici&oacute;n es un llamado a una
  operaci&oacute;n del objeto receptor y por lo tanto tiene argumentos y
  visibilidad y alcance.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia025.png" height="87" width="358"></p>
<p style="text-align: center;" class="Imagen">Figura 32. Argumentos de la transici&oacute;n</p>
<p class="TextoNormal">Seleccione Agregar y Especifique
  el Nombre, Tipo y Valor del argumento.Escoja la direcci&oacute;n de este In,
  Out, In-Out.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia027.png" height="178" width="244"></p>
<p style="text-align: center;" class="Imagen">Figura 33. Datos b&aacute;sicos para la creaci&oacute;n de un argumento</p>
<p class="TextoNormal" align="left">Seleccione La
  visibilidad de la transici&oacute;n, el Alcance de esta, y su tipo de
  Implementaci&oacute;n (Abstracta o no); puede agregar c&oacute;digo de la
  implementaci&oacute;n seccionando el bot&oacute;n Cod/Com.</p>
<p class="TextoNormal" align="left">Tambi&eacute;n puede
  utilizar los Modificadores Sincronizada, Garantizada, Consulta y Hoja.</p>
<p class="TextoNormal" align="left">Los servicios
  Disponibles corresponden con todas las Operaciones asociadas al Objeto
  Receptor de la Transici&oacute;n, seleccione los servicios relacionados con la
  transici&oacute;n; las nuevas transiciones ser&aacute;n guardadas como operaciones en
  la clase asociada al Objeto Receptor y por lo tanto seleccionables
  desde este campo por otras Transiciones.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia031.png" height="244" width="367"></p>
<p style="text-align: center;" class="Imagen">Figura 34. Visibilidad, Modificadores, Alcance/Implementaci&oacute;n y Servicios de un argumento</p>
<p class="TextoNormal" align="left">Un Transici&oacute;n
  luce como se aprecia en la Figura 35.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia033.png" height="194" width="376"></p>
<p style="text-align: center;" class="Imagen">Figura 35. Transici&oacute;n con diferentes elementos ingresados</p>
<p class="TextoNormal" align="left">Note la
  numeraci&oacute;n a la izquierda del icono de visibilidad de la transici&oacute;n
  (publico en este caso). Es conveniente mantener las transiciones
  numeradas y en orden para poder seguir la secuencia f&aacute;cilmente. Para
  editar este n&uacute;mero haga doble clic sobre este y escriba la numeraci&oacute;n
  correspondiente.</p>
<p class="TextoNormal" align="left">Para <strong>editar
  el Tama&ntilde;o del cuadrado del Foco de Control </strong>haga clic
  sobre este, aparecer&aacute;n redimencionadores, arriba y abajo del Cuadrado, </p>
<p style="text-align: center;" class="Imagen"><img src="secuencia034.png" height="56" width="16"></p>
<p style="text-align: center;" class="Imagen">Figura 36. Tama&ntilde;o de la transici&oacute;n</p>
<p class="TextoNormal" align="left">Haga clic
  sostenido sobre estos y arrastre el cursor hasta obtener el tama&ntilde;o
  deseado.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia035.png" height="121" width="267"></p>
<p style="text-align: center;" class="Imagen">Figura 37. Aumento de la longitud en la relaci&oacute;n</p>
<p class="TextoNormal" align="left">Puede <strong>Cambiar
  la posici&oacute;n </strong>del foco de control, haga clic sostenido
  sobre la l&iacute;nea de la transici&oacute;n y arrastre con el cursor. Los dos focos
  de control involucrados se desplazaran.</p>
<p align="justify" class="TextoNormal"><span class="TextoResaltado">Transiciones
  Anidadas:</span> las
  transiciones anidadas presentan un foco de control superpuesto a otro
  foco de control en la misma l&iacute;nea de vida. Representan el paso del Foco
  de control por parte de alguna operaci&oacute;n del objeto, hacia otra
  operaci&oacute;n del mismo objeto o bien representan llamados recursivos. </p>
<div class="Imagen" style="text-align: center;">
  <p><br>
      <img src="compuesta10.png" width="401" height="59"></p>
  <p>Figura 38. Creaci&oacute;n de transici&oacute;n c&iacute;clica</p>
</div>
<p class="TextoNormal" align="left">Una forma de
  crear Transiciones anidadas sucede cuando el segundo llamado es
  originado por el mismo objeto pero su destino es otro objeto receptor.
  Para representar esto, basta con seleccionar el icono Transici&oacute;n y
  luego hacer clic sobre un foco de control receptor de otra transici&oacute;n,
  autom&aacute;ticamente su &aacute;rea se expande para albergar el nuevo foco de
  control. haga clic sobre la l&iacute;nea de vida del correspondiente objeto
  receptor de esta segunda transici&oacute;n.</p>
<p class="Imagen" align="center"><img src="secuencia037.png" height="144" width="256"></p>
<p class="Imagen" align="center">Figura 39. Representaci&oacute;n de la transici&oacute;n c&iacute;clica</p>
<p class="TextoNormal" align="left">Los llamados
  recursivos se crean expl&iacute;citamente, haga clic sobre el icono Transici&oacute;n
  C&iacute;clica y luego haga clic sobre una l&iacute;nea de vida de alg&uacute;n objeto. La
  transici&oacute;n c&iacute;clica tambi&eacute;n puede ser anidada. Posteriormente haga clic sobre el Icono
  Transici&oacute;n c&iacute;clica y luego sobre alg&uacute;n foco de control receptor de
  Transici&oacute;n.</p>
<p style="text-align: center;" class="Imagen"><img src="secuencia041.png" height="263" width="341"></p>
<p style="text-align: center;" class="Imagen">Figura 40. Transici&oacute;n c&iacute;clica anidada y no anidada</p>
<p><span style="font-weight: bold;">Transición: </span>&nbsp;La transición es uno de los
  elementos mas importantes del diagrama, ya que permite conectar las
  actividades, Estado de Inicio, Estado de Fin y todos los otros
  elementos del esquema. El icono de transici&oacute;n corresponde al de
  una flecha curva en la barra específica del marco<br>
  <br>
</p>
<div class="Imagen" style="text-align: center;">
  <p><br>
      <img src="compuesta11.png" width="377" height="64"></p>
  <p>Figura 41. Creaci&oacute;n de una transici&oacute;n simple</p>
</div>
<br>
Para generar una conexión mediante una transición primero
se debe hacer clic en el icono, posterior &nbsp;a esto se hace
clic dentro del área de trabajo sobre el elemento origen, es
decir, de donde proviene el flujo del diagrama<br>
<br>
<br>
<div class="Imagen" style="text-align: center;">
  <p><img src="transicion2.png" alt="" width="137" height="133"></p>
  <p>Figura 42. Representaci&oacute;n de la transici&oacute;n<br>
    </p>
</div>
<br>
Posterior a esto se hace clic sobre el elemento destino, es decir,
hacia donde se dirige el flujo. Uno vez hecho esto se abre el
diálogo para generar los parámetros para dicha
transición<br>
<br>
<br>
<div class="Imagen" style="text-align: center;">
  <p><img src="transicion3.png" alt=""></p>
  <p>Figura 43. Ingreso de datos b&aacute;sicos de la transici&oacute;n<br>
    </p>
</div>
<br>
Los parámetro de disparo, guarda y efecto son opcionales, la
transición puede ser generada con ninguno o algunos de ellos. El
disparo se presenta en primer lugar, la guarda se presenta entre
corchetes cuadrados "[ ]" y por último el efecto se separa mediante "/"<br>
<br>
<div class="Imagen" style="text-align: center;">
  <p><img src="transicion4.png" alt=""></p>
  <p>Figura 44. Representaci&oacute;n de diparo, guarda y efecto en la transici&oacute;n<br>
    </p>
</div>
<p><br>
  Así como con otros elementos gráficos de conexion en
  UML+, es posible modificar la presentación de éste, tanto
  en color como en forma que se va a dibujar la conexión.</p>
<p class="style2"><span class="TextoResaltado">Uso Conjunto</span>: Utilice los elementos del diagrama de vista Conjunta de forma libre para crear partes de un diagrama de actividades y partes de diagramas de secuencia que se relacionan entre s&iacute; mediante alguna transici&oacute;n entre sus elementos. Tambi&eacute;n puede utilizar los frames para expandir el nivel de vista de alg&uacute;n elemento o para visualizar un diagrama externo que se relacione con el diagrama de vista conjunta. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="conjunta.png" width="419" height="286"></p>
  <p>Figura 45. Diferentes elementos en conjunto en un diagrama de vista conjunta</p>
</div>
<p><br>
  <span style="font-weight: bold;"></span><br>
</p></td>
</tr>
</tbody>
</table>
</body></html>