<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><title>Plugin de Sistema</title>

<link rel="stylesheet" href="../estilo.css">
</head>
<body topmargin="0">
<table align="center" border="0" height="95" width="478">
<tbody>
<tr>
<td height="23">
<p class="Titulo" align="left">Plugin
Estructura Compuesta</p></td>
</tr>
<tr>
<td height="66" valign="top" width="472">
<p class="TextoNormal">El plugin de Sistema&nbsp; es
parte de la solución UML para la realización de
diagramas. Permite
modelar agrupaciones puramente conceptuales de elementos del sistema que &quot;colaboran&quot; entre s&iacute; de acuerdo a la especificaci&oacute;n de alg&uacute;n clasificador m&aacute;s general que los contiene.<br class="TextoNormal">
</p>
<p class="TextoNormal" align="left">Los elementos
propios que maneja este diagrama son:&nbsp; </p>
<ul class="TextoNormal">
<li>Colaboraci&oacute;n</li>
<li> Parte</li>
<li>Interfase Requerida</li>
<li>Interfase Proveeida</li>
<li>Dependencia</li>
<li>Asociaci&oacute;n</li>
</ul>
<p class="TextoNormal" align="left"><span class="TextoResaltado">Creación de un nuevo Diagrama de Sistemas.</span></p>
<p class="TextoNormal" align="left">Colosoft
soporta el Plugin de Estructura Compuesta mediante la creación de un nuevo diagrama de
Estructura Compuesta. <br>
<br>
Para la creación de un nuevo diagrama usando el Plugin se selecciona en
el Marco de Expresión: Nuevo, Arquitecto de Software, Diagrama de Estructura Compuesta.</p>
<p class="TextoNormal" align="left">Se ingresan
los datos correspondientes al diagrama en la ventana que aparece.</p>
<p align="center" class="Imagen" style="text-align: center;"><img src="compuesta000.png" width="214" height="226">&nbsp;&nbsp;<img src="compuesta001.png" width="234" height="46"></p>
<p align="center" class="Imagen" style="text-align: center;">FIgura 1. Creaci&oacute;n de un diagrama de estructura compuesta</p>
<p class="TextoNormal">Barra de
  herramientas del Plugin de Sistema:</p>
<p align="left" class="Imagen" style="text-align: center;"><img src="compuesta002.png" width="398" height="21"></p>
<p align="left" class="Imagen" style="text-align: center;">Figura 2. Barra espec&iacute;fica del plugin</p>
<p class="TextoNormal" align="left"><span class="TextoResaltado">Colaboraci&oacute;n: </span>agrupamiento de clases, interfaces, relaciones, objetos y  otros elementos que cooperan entre s&iacute;, las colaboraciones pueden contener todos los elementos usados para modelar estructuras o bien para modelar interacciones de los sistemas.</p>
<p class="TextoNormal" align="left">Para Crear una
nueva Colaboraci&oacute;n, haga clic en el Icono Colaboraci&oacute;n de la barra de
herramientas del Plugin y luego haga clic en un espacio en blanco del
diagrama.</p>
<p style="text-align: center;" class="Imagen"><img src="compuesta003.png" width="376" height="22"></p>
<p style="text-align: center;" class="Imagen">Figura 3. Creaci&oacute;n de una colaboraci&oacute;n</p>
<p class="TextoNormal" align="left">Se muestra una ventana, como en la Figura 4, de especificación del Sistema:</p>
<p align="center" class="Imagen"><img src="compuesta006.png" width="370" height="296" class="TextoResaltado"></p>
<p align="center" class="Imagen">Figura 4. Datos de creaci&oacute;n de una colaboraci&oacute;n</p>
<p align="center" class="TextoNormal">Nombre a la colaboraci&oacute;n y utilice el campo de Ocurrencia para especificar el origen de la Colaboraci&oacute;n.</p>
<p align="center" class="TextoNormal">Utilice perfiles para expandir la sem&aacute;ntica de la colaboraci&oacute;n, indicando su proposito y/o uso.</p>
<p align="center" class="TextoNormal">Las colaboraci&oacute;n creada con el icono de su perfil luce como sigue:</p>
<p align="center" class="Imagen"><img src="compuesta007.png" width="223" height="145"></p>
<p align="center" class="Imagen">Figura 5. Representaci&oacute;n de una colaboraci&oacute;n</p>
<p align="center" class="TextoNormal">Las colaboraciones pueden ser editadas visualemente, para agrandar o contraer el &aacute;rea de la colaboraci&oacute;n seleccionela y arrastre de su esquina inferior derecha hasta el tama&ntilde;o deseado.</p>
<p align="center" class="Imagen"><img src="compuesta013.png" width="295" height="217"></p>
<p align="center" class="Imagen">Figura 6. Cambiando de tama&ntilde;o la colaboraci&oacute;n</p>
<p align="left" class="TextoNormal"><span class="TextoResaltado">Parte: </span>instancia o colecci&oacute;n de instancias que juegan un rol para el clasificador al que pertenecen en tiempo de ejecuci&oacute;n.</p>
<p align="left" class="TextoNormal">Para Crear una
nueva Parte, haga clic en el Icono Parte de la barra de
herramientas del Plugin y luego haga clic en un espacio en blanco del
diagrama o sobre una colaboraci&oacute;n existente.</p>
<p align="center" class="Imagen"><img src="compuesta009.png" width="376" height="22"></p>
<p align="center" class="Imagen">Figura 7. Creando una parte</p>
<p class="TextoNormal" align="left">Se muestra una ventana, como la de la Figura 8, para la especificaci&oacute;n de la parte.</p>
<p align="center" class="Imagen"><img src="compuesta008.png" width="370" height="247"></p>
<p align="center" class="Imagen">Figura 8. Datos de creaci&oacute;n de una parte</p>
<p align="center" class="TextoNormal">Se agrega el nombre de  la parte y el estereotipo, Utilice los perfiles disponibles para expandir su sem&aacute;ntica. La Parte creada con el icono de su perfil luce como se muestra en la Figura 9.</p>
<p align="center" class="Imagen"><img src="compuesta010.png" width="74" height="43"></p>
<p align="center" class="Imagen">Figura 9. Representaci&oacute;n de una parte</p>
<p align="center" class="TextoNormal">Utilice los iconos de expansi&oacute;n de la parte para crear, desde esta, interfaces requeridas o provistas desde &eacute;sta.</p>
<p align="center" class="Imagen"><img src="compuesta011.png" width="102" height="63"></p>
<p align="center" class="Imagen">Figura 10. Iconos de expansi&oacute;n de una parte</p>
<p class="TextoNormal" align="left"><span class="TextoResaltado">Objeto: </span>Puede  insertar objetos en su diagrama de estructura compuesta, para modelar comportamientos en tiempos de ejecuci&oacute;n.</p>
<p class="TextoNormal" align="left">Para crear un
  nuevo Objeto, haga clic en el icono Objeto de la barra de
  herramientas del Plugin y luego haga clic en un espacio en blanco del
  diagrama o dentro de una colaboraci&oacute;n para especificar objetos externos a la colaboraci&oacute;n o propios de esta respectivamente.</p>
<p align="center" class="Imagen"><img src="compuesta014.png" width="376" height="22"></p>
<p align="center" class="Imagen">Figura 11. Icono de creaci&oacute;n de un objeto</p>
<p align="center" class="TextoNormal
"><span class="TextoNormal">Se muestra la la
  ventana de especificaci&oacute;n del Objeto, como aparece en la Figura 12.</span></p>
<p align="center" class="Imagen"><img src="compuesta016.png" width="370" height="93"></p>
<p align="center" class="Imagen">Figura 12. Pantalla de creaci&oacute;n del objeto</p>
<p align="center" class="TextoNormal">Consultar el <a href="../pluginObjetos/index.html">diagrama de objetos</a> para ver como especificar el objeto y asociarlo a una clase de un diagrama de clases.</p>
<p align="center" class="TextoNormal">El nuevo objeto creado para una colaboraci&oacute;n luce como sigue:</p>
<p align="center" class="Imagen"><img src="compuesta017.png" width="315" height="224"></p>
<p align="center" class="Imagen">Figura 13. Representaci&oacute;n de un objeto</p>
<p class="TextoNormal" align="left"><span class="TextoResaltado">Clase: </span>Puede  insertar Clases en su diagrama de estructura compuesta, para modelar estructuras tanto dentro como fuera de una colaboraci&oacute;n.</p>
<p class="TextoNormal" align="left">Para Crear un
  nueva Clase, haga clic en el Icono Clase de la barra de
  herramientas del Plugin y luego haga clic en un espacio en blanco del
  diagrama o dentro de una colaboraci&oacute;n para especificar clases externos a la colaboraci&oacute;n o propios de esta respectivamente.</p>
<p align="center" class="Imagen"><img src="compuesta019.png" width="376" height="22"></p>
<p align="center" class="Imagen">Figura 14. Bot&oacute;n de creaci&oacute;n de una clase</p>
<p align="center" class="TextoNormal"><span class="TextoNormal">Aparece la
  ventana de especificaci&oacute;n de la clase:</span></p>
<p align="center" class="Imagen"><img src="compuesta020.png" width="370" height="247"></p>
<p align="center" class="Imagen">Figura 15. Atributos de creaci&oacute;n de una clase</p>
<p align="center" class="TextoNormal">Consulta el <a href="../pluginClases/index.html">diagrama de clases</a> para ver como especificar la clase y crear relaciones entre estas.</p>
<p align="center" class="TextoNormal">La nueva clase creada para una colaboraci&oacute;n luce como sigue:</p>
<p align="center" class="Imagen"><img src="compuesta021.png" width="408" height="303"></p>
<p align="center" class="Imagen">Figura 16. Representaci&oacute;n de la clase</p>
<p align="left" class="TextoNormal
"><span class="TextoResaltado">Interfaz Requerida:</span><span class="TextoNormal"> Cree Interfaces requeridas en su diagrama de estructura compuesta, asociadas con las colaboraciones y otros elementos como clases o partes que puedan exponer interfaces provistas.</span> Tambi&eacute;n utilice la interfaces requerida para modelar comportamientos entre clases seg&uacute;n el <a href="../pluginClases/index.html">Diagrama de clases</a>.</p>
<p class="TextoNormal" align="left">Para crear un
  nueva interfaz, haga clic en el icono Interfaz Provista de la barra de
  herramientas del Plugin, luego haga clic sobre una colaboraci&oacute;n o clase (seg&uacute;n el caso) y arrastre el cursor hacia un espacio en blanco o hacia una interfase provista.</p>
<p align="center" class="Estilo9"><img src="compuesta022.png" width="376" height="22"></p>
<p align="center" class="Estilo9">Figura 17. Creaci&oacute;n de una interface requerida</p>
<p align="center" class="TextoNormal">Para consultar sobre la especificaci&oacute;n de interfaces vea el<a href="../pluginClases/index.html"> Diagrama de Clases</a>.</p>
<p align="center" class="TextoNormal">La Interfaz Requerida asociada a la colaboraci&oacute;n se muestra en la Figura 18.</p>
<p align="center" class="Imagen"><img src="compuesta024.png" width="221" height="246"></p>
<p align="center" class="Imagen">Figura 18. Representaci&oacute;n de una interface requerida</p>
<p align="left" class="TextoNormal
"><span class="TextoResaltado">Interfaz Prove&iacute;da:</span><span class="TextoNormal"> Cree Interfaces Provistas en su diagrama de estructura compuesta asociadas con las Clases y Partes .</span> Tambi&eacute;n utilice la interfases prove&iacute;da para modelar comportamientos entre clases seg&uacute;n el <a href="../pluginClases/index.html">Diagrama de Clases.</a></p>
<p class="TextoNormal" align="left">Para Crear un
  nueva Interfases, haga clic en el Icono Interfases Prove&iacute;da de la barra de
  herramientas del Plugin y luego haga clic sobre una parte o clase (seg&uacute;n el caso) y arrastre el cursor hacia un espacio en blanco o hacia una interfaz Requerida.</p>
<p align="center" class="Imagen"><img src="compuesta025.png" width="376" height="22"></p>
<p align="center" class="Imagen">Figura 19. Creaci&oacute;n de una interface provista</p>
<p align="center" class="TextoNormal">Para consultar sobre la especificaci&oacute;n de interfaces vea el<a href="../pluginClases/index.html"> Diagrama de Clases</a>.</p>
<p align="center" class="TextoNormal">Una Interfaz Proveida asociada una Intefaz Requerida de un colaboraci&oacute;n luce de la siguiente forma:</p>
<p align="center" class="Imagen"><img src="compuesta027.png" width="355" height="253"></p>
<p align="center" class="Imagen">Figura 20. Conexi&oacute;n entre interface requerida y provista</p>
<p align="center" class="TextoNormal
"><span class="TextoNormal">Una Interfaz Proveida tambi&eacute;n puede estar asociada a una Parte, como se muestra en la Figura 21.</span></p>
<p align="center" class="Imagen"><img src="compuesta033.png" width="195" height="339"></p>
<p align="center" class="Imagen">Figura 21. Conectando una colaboraci&oacute;n con una parte a trav&eacute;s de interfaces</p>
<p align="center" class="TextoNormal
"><span class="TextoResaltado">Dependencias: </span><span class="TextoNormal
">Cree relaciones entre las colaboraciones para especificar la sem&aacute;ntica entre estas, utilice los estereotipos para dar sentido a la relaci&oacute;n.</span></p>
<p align="center" class="TextoNormal
"><span class="TextoNormal">Para crear un
  nueva dependencia, haga clic en el Icono Dependencia de la barra de
  herramientas del Plugin y luego haga clic sobre una Colaboraci&oacute;n de connotaci&oacute;n m&aacute;s general. A continuaci&oacute;n haga clic en una segunda colaboraci&oacute;n de connotaci&oacute;n m&aacute;s espec&iacute;fica.</span></p>
<p align="center" class="Imagen"><img src="compuesta028.png" width="376" height="22"></p>
<p align="center" class="Imagen">Figura 22. Creaci&oacute;n de una dependencia</p>
<p align="center" class="TextoNormal
"><span class="TextoNormal">Aparece la
  ventana de especificaci&oacute;n de la Dependencia, especifique el estereotipo adecuado, consulte el &quot;<a href="../pluginClases/index.html">Diagrama de Clases</a>&quot; para especificar los roles de la relaci&oacute;n:</span></p>
<p align="center" class="Imagen"><img src="compuesta031.png" width="362" height="126"></p>
<p align="center" class="Imagen">Figura 23. Estereotipos para la creaci&oacute;n de una dependencia</p>
<p align="left" class="TextoNormal
">La relaci&oacute;n de refinamiento para la colaboraci&oacute;n2 que refina a la Colaboraci&oacute;n 1 luce como sigue:</p>
<p align="center" class="Imagen"><img src="compuesta029.png" width="436" height="134"></p>
<p align="center" class="Imagen">Figura 24. Relaci&oacute;n de dependencia entre colaboraciones</p>
<p align="center" class="TextoNormal
"><span class="TextoResaltado">Asociaciones: </span>Cree Asociaciones entre colaboraciones y Clases.</p>
<p align="center" class="TextoNormal
"><span class="TextoNormal">Para Crear un
  nueva Asociaci&oacute;n, haga clic en el Icono Asociaci&oacute;n de la barra de
  herramientas del Plugin y luego haga clic sobre una Colaboraci&oacute;n. Luego haga clic en una clase existente del diagrama.</span></p>
<p align="center" class="Imagen"><img src="compuesta034.png" width="376" height="22"></p>
<p align="center" class="Imagen">Figura 25. Creaci&oacute;n de una asociaci&oacute;n</p>
<p align="center" class="TextoNormal"><span class="TextoNormal">Se muestra una ventana con la especificaci&oacute;n de la Asociaci&oacute;n, tal como en la Figura 26. Especifique el estereotipo adecuado, consulte el &quot;<a href="../pluginClases/index.html">Diagrama de Clases</a>&quot; para especificar los roles de la relaci&oacute;n:</span></p>
<p align="center" class="Imagen"><img src="compuesta032.png" width="370" height="133"></p>
<p align="center" class="Imagen">Figura 26. Datos para la creaci&oacute;n de una asociaci&oacute;n</p>
<p align="left" class="TextoNormal
">La relaci&oacute;n de Asociaci&oacute;n se muestra en la Figura 27.</p>
<p align="center" class="Imagen"><img src="compuesta035.png" width="358" height="218"></p>
<p align="center" class="Imagen">Figura 27. Representaci&oacute;n de una asociaci&oacute;n</p>
<p align="left" class="TextoNormal"TextoNormal"><span class="TextoResaltado">Modelado de Estructuras:</span> cree diagramas de clases usando los iconos de expansi&oacute;n para los elementos Clase e Interfaz para modelar estructuras est&aacute;ticas del sistema como sigue:.</span></p>
<p align="center" class="Imagen"><img src="compuesta048.png" width="373" height="298"></p>
<p align="center" class="Imagen">Figura 28. Modelando estructuras mediante clases, objetos y relaciones</p>
<p align="center" class="TextoNormal">Los iconos de expansi&oacute;n proveen de los elementos necesarios para generar diagramas completos de clases tambi&eacute;n puede utilizar los iconos de la barra de herramientas del plugin de Estructura compuesta Puerto y Enlace Puerto Puerto.</p>
<p align="center" class="TextoNormal"><span class="TextoResaltado">Modelo de Comportamientos: </span>cree diagramas de interacci&oacute;n usando los iconos de expansi&oacute;n para los elementos Objeto para modelar comportamientos de instancias en tiempo de ejecuci&oacute;n como sigue:</p>
<p align="center" class="TextoNormal">Cree mensajes entre los objetos utilizando la herramienta Mensaje de la parra del Plugin, para ver como se especifican los mensajes vea el <a href="../pluginObjetos/index.html">diagrama de objetos</a> o el <a href="../pluginComunicacion/index.html">diagrama de comunicaci&oacute;n</a>.</p>
<p align="center" class="TextoResaltado"><img src="compuesta041.png" width="376" height="22"></p>
<p align="center" class="TextoNormal"><span class="TextoNormal">Los iconos de expansi&oacute;n proveen de accesos r&aacute;pidos para la creaci&oacute;n de mensajes entre objetos.</span></p>
<p align="center" class="Imagen"><img src="compuesta046.png" width="351" height="289"></p>
<p align="center" class="Imagen">Figura 29. Modelando comportamiento dentro de una colaboraci&oacute;n</p>
<p align="center" class="TextoResaltado">&nbsp;</p></td>
</tr>
</tbody>
</table>
</body></html>