<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><title>Plugin ITE</title>

<link rel="stylesheet" href="../estilo.css"></head>
<body topmargin="0">
<table align="center" border="0" height="95" width="478">
<tbody>
<tr>
<td height="23">
<p class="Estilo4" align="left">Plugin ITE</p></td>
</tr>
<tr>
<td height="66" width="472">
<p align="center" class="TextoNormal"><br>
  El Ambiente de Prueba Integrado ITE (Integrated Test Enviroment, por sus siglas en ingl&eacute;s) es un Framework creado para facilitar la tarea de realizar pruebas unitarias. Agiliza la labor del Ingeniero de pruebas, al reducir el n&uacute;mero de pasos que debe hacer para crear y ejecutar una prueba unitaria.<br>
  <br>
La prueba unitaria es un procedimiento usado para validar que un m&oacute;dulo de c&oacute;digo fuente funciona apropiadamente. Una prueba unitaria arroja como resultado un acierto, un error o un fallo.</p>
<p align="center" class="TextoNormal"><span class="TextoResaltado">Creaci&oacute;n de un nuevo entorno de Pruebas: </span>Para utilizar el Framework ITE debe crear un nuevo entorno mediante el Plugin ITE. Se selecciona en
    el Marco de Expresi&oacute;n: Nuevo, Ingeniero  de Pruebas, ITE.</p>
<p align="center" class="Imagen"><img src="0.png" width="428" height="185" class="IMAGEN_CENTRADA"></p>
<p align="center" class="Imagen">Figura 1. Creando un entorno ITE</p>
<p class="TextoResaltado">Barra de
  herramientas del Plugin Diagrama de Inter&eacute;s: </p>
<p class="Imagen"><img src="IFE-0007.png" width="158" height="23"></p>
<p class="Imagen">Figura 2. Barra de herramientas del plugin</p>
<p class="TextoNormal"><span class="TextoResaltado">Nueva Clase:</span> Seleccione el icono Nuevo para crear una clase vac&iacute;a, como se muestra en la Figura 3.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/nuevaclase.PNG" width="160" height="64"></p>
  <p>Figura 3. Creando una clase</p>
</div>
<p class="TextoNormal"> Escriba un nombre para a la nueva clase, dicho nombre ser&aacute; usado tambi&eacute;n para nombrar el archivo de c&oacute;digo fuente. Ej.  (Clase_Prueba.java).</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/nombrarclase.PNG" width="170" height="112"></p>
  <p>Figura 4. Nombrado de la nueva clase</p>
</div>
<p class="TextoNormal"> Colosoft genera una nueva clase vac&iacute;a e inicia el editor de c&oacute;digo. <br>
</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/codigoinicial.PNG" width="276" height="155"></p>
  <p>Figura 5. Nueva clase vac&iacute;a en el editor de c&oacute;digo</p>
</div>
<p class="TextoNormal"> <span class="TextoResaltado">Importar Archivos de C&oacute;digo:</span> Seleccione el bot&oacute;n Importar. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/clicimportaar.PNG" width="182" height="60"></p>
  <p>Figura 6. Importar c&oacute;digo desde el editor</p>
</div>
<p class="TextoNormal">Seguidamente se abrir&aacute; una ventada de selecci&oacute;n de archivos. Importe archivos .java que contengan c&oacute;digo fuente. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/seleccionarjava.PNG" width="301" height="159"></p>
  <p>Figura 7. Seleccionando el archivo de c&oacute;digo a importar</p>
</div>
<p class="TextoNormal"> <span class="TextoResaltado">Editor: </span>edite o inserte c&oacute;digo a modo de texto, el editor de c&oacute;digo de Colosoft permite trabajar c&oacute;modamente sobre el c&oacute;digo resaltando con diferentes colores las palabras claves correspondientes al lenguaje de programaci&oacute;n.<br>
</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/resaltarcodigo.PNG" width="199" height="205"></p>
  <p>Figura 8. Editor de c&oacute;digo</p>
</div>

<p 
 align="justify"><span class="TextoResaltado" style="font-weight: bold;">Probar el C&oacute;digo:</span><span style="font-weight: bold;">&nbsp;</span><span class="TextoNormal">Para comenzar a realizar las pruebas haga clic sobre el bot&oacute;n Compilar ubicado en la esquina superior derecha del marco de expresi&oacute;n del Plugin ITE.</span></p>
<p class="Imagen"><img src="IFE-0019.png" width="121" height="85"></p>
<p class="Imagen">Figura 9. Compilaci&oacute;n de c&oacute;digo en el entorno</p>
<p class="TextoNormal">En el Marco de Extensi&oacute;n bajo la pesta&ntilde;a &quot;Consola de Compilaci&oacute;n&quot; puede observar el resultado de la compilaci&oacute;n. Corrija todos los errores que aqu&iacute; se presenten antes de proceder con la depuraci&oacute;n. </p>
<p align="center" class="Imagen"><img src="5.png" width="202" height="133"></p>
<p align="center" class="Imagen">Figura 10. Resultados de la compilaci&oacute;n</p>
<p><span class="TextoResaltado" style="font-weight: bold;">Prueba Unitaria :</span><span style="font-weight: bold;">&nbsp;</span><span class="TextoNormal">Establezca pruebas unitarias para los m&oacute;dulos que desee probar.  Para agregar una Prueba haga clic al lado izquierdo de una l&iacute;nea de c&oacute;digo que contenga una declaraci&oacute;n, aparecer&aacute; un marcador rojo a la izquierda del numero de l&iacute;nea.</span>    </p>
</p>
<p class="TextoNormal">Agregue tantas pruebas como m&oacute;dulos quiera probar. </p>
<p align="center" class="Imagen"><img src="6.png" width="183" height="125"></p>
<p align="center" class="Imagen">Figura 11. Marca para pruebas unitarias</p>
<span class="TextoResaltado" style="font-weight: bold;">Realizar Pruebas :</span><span style="font-weight: bold;">&nbsp;</span><span class="TextoNormal">Con las pruebas unitarias ya establecidas, haga clic sobre el bot&oacute;n Probar para iniciar el proceso. </span>
<p align="center" class="Imagen"><img src="7.png" width="183" height="132"></p>
<p align="center" class="Imagen">Figura 12. Ejecuci&oacute;n de las pruebas</p>
<p class="TextoNormal">Colosoft generar&aacute; una clase de Pruebas a partir de los m&oacute;dulos marcados con pruebas unitarias, dentro de esta clase puede editar los valores de las aserciones a realizar para cada modulo.</p>
<p class="TextoNormal">Con la clase de pruebas  establecida, haga clic en el icono de Paso Dentro, para ir ejecutando una a una las pruebas. </p>
<p align="center" class="Imagen"><img src="8.png" width="312" height="412"></p>
<p align="center" class="Imagen">Figura 13. Clase para pruebas unitarias</p>
<p align="center" class="TextoNormal"><span class="TextoNormal" style="font-weight: bold;">Visualizaci&oacute;n de Resultados: </span>Dentro del Marco de Extensi&oacute;n, bajo la pesta&ntilde;a Consola De Prueba y en la vista de Jerarqu&iacute;a, Colosoft mostrar&aacute; el resultado de cada prueba, la cantidad de Aciertos, Fallos y Errores, y el rastro de estos sobre los resultados de la compilaci&oacute;n. </p>
<p align="center" class="Imagen"><img src="9.png" width="369" height="336"></p>
<p align="center" class="Imagen">Figura 14. Visualizaci&oacute;n de resultados en la consola de prueba</p>
<p align="center" class="TextoNormal"><span class="TextoNormal" style="font-weight: bold;">Visualizaci&oacute;n de Estad&iacute;sticas: </span>Bajo la Vista de Estad&iacute;stica podr&aacute; ver un gr&aacute;fico representativo de los resultados de las pruebas unitarias. </p>
<p align="center" class="Imagen"><img src="10.png" width="369" height="336"></p>
<p align="center" class="Imagen">Figura 15. Estad&iacute;sticas gr&aacute;ficas de las pruebas</p>
<p class="TextoNormal"><span class="TextoResaltado">Guardar:</span> Guarde los cambios realizados en el c&oacute;digo editado sobre el archivo fuente de la clase que actualmente est&aacute; abierto. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/guardar.PNG" width="177" height="65">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>
  <p>Figura 16. Guardar el c&oacute;digo del editor</p>
</div>
<p> <span class="TextoResaltado">Imprimir:</span><span class="TextoNormal"> Imprima el C&oacute;digo fuente desde el editor de c&oacute;digo a su impresora, utilizando la opci&oacute;n Imprimir y el di&aacute;logo gen&eacute;rico de impresi&oacute;n.<br>
</span></p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/imprimir.PNG" width="175" height="60">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>
  <p>Figura 17. Imprimir el c&oacute;digo actual</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">Deshacer - Rehacer</span>: Deshaga cambios realizados en el c&oacute;digo mediante la opci&oacute;n Deshacer, y rehaga cambios previamente descartados mediante la opci&oacute;n Rehacer. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/redeshacer.PNG" width="204" height="57"></p>
  <p>Figura 18. Rehacer los cambios en el editor</p>
</div>
<p class="TextoNormal" align="center">&nbsp;</p></td>
</tr>
</tbody>
</table>
</body></html>