<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><title>Plugin de Actividades</title>

<link rel="stylesheet" href="../estilo.css">
</head>

<body topmargin="0">
<table align="center" border="0" height="95" width="478">
<tbody>
<tr>
<td height="23">
<p class="Estilo4" align="left">Plugin de Inter&eacute;s </p></td>
</tr>
<tr class="TextoNormal TextoNormal">
<td width="472" height="66"><p class="TextoNormal">  <br>
  El plugin Diagrama de Interes perimite realizar diagramas personalisados que incluyen elementos de <span class="TextoItalico">Objetos de tipo interesado</span> que pueden establecer generalizaciones entre s&iacute;, resaltando porciones de estos objetos mediante el uso de notas. </p>
  <p class="TextoNormal">Los elementos propios de este diagrama son: </p>
  <ul class="TextoNormal">
<li> Interesado </li>
<li> Nota de Inter&eacute;s </li>
<li>Generalizaci&oacute;n</li>
</ul>
  <p class="TextoResaltado" align="left">Creaci&oacute;n de un nuevo Diagrama de Inter&eacute;s: </p>
  <p class="TextoNormal" align="left">Colosoft
    soporta el Plugin de Inter&eacute;s mediante la creaci&oacute;n de un nuevo
    diagrama de Inter&eacute;s. <br>
  <br>
    Para la creaci&oacute;n de un nuevo diagrama se selecciona en
    el Marco de Expresi&oacute;n: Nuevo, Ingeniero de Requerimientos, Diagrama de
    Inter&eacute;s.</p>
  <p class="TextoNormal" align="left">Se ingresan
    los datos correspondientes al diagrama.</p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><img src="interes03.png" width="404" height="246"></p>
    <p>Figura 1. Creaci&oacute;n de un diagrama de inter&eacute;s</p>
  </div>
  <p class="TextoNormal" align="left"><span class="TextoResaltado">Barra de
herramientas del Plugin Diagrama de Inter&eacute;s:</span> La barra de herramientas espec&iacute;fica del diagrama de interes posee botones para la creaci&oacute;n de interesados, notas de inter&eacute;s, sistemas, frames, notas y generalizaciones.</p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><img src="interes04.png" width="196" height="26"></p>
    <p>Figura 4. Barra del diagrama de inter&eacute;s</p>
  </div>
  <p align="justify"><span class="TextoNormal" style="font-weight: bold;">&nbsp;Interesado:&nbsp;</span><span class="TextoNormal">Son Objetos que guardan un inter&eacute;s particular respecto del sistema con el que interact&uacute;an o pertenecen. </span></p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><img src="interes05.png" width="187" height="67"></p>
    <p>Figura 5. Creando un Interesado</p>
  </div>
  <p class="TextoNormal"> Para agregar una actividad se selecciona el icono Interesado y luego se hace clic en alg&uacute;n espacio en blanco del diagrama, sobre un frame o sistema. </p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><span class="TextoNormal" style="text-align: center;"><img src="../pluginObjetos/objetos007.png" height="161" width="370"></span></p>
    <p>Figura 6. Atributos del interesado</p>
  </div>
  <p class="TextoNormal">Aparecer&aacute; la
    ventana de especificaci&oacute;n de un
    Objeto,como se muestra en la Figura 6, que permite asignarle
    un nombre y una clase de la cual toma las propiedades. &nbsp;Para
    asignarle una clase preexistente o agregarle atributos y operaciones al
    actor es necesario que al menos un diagrama de clases se encuentre
    activo en el &nbsp;marco de expresi&oacute;n. Para asociar una clase al Interesado seleccione
    una clase existente de la lista deplegable Clase o si lo requiere cree
    una Nueva Clase haciendo clic en Nueva Clase.</p>
  <p align="left" class="TextoNormal"><span class="TextoResaltado">Nueva Clase: </span>la ventana de
      creaci&oacute;n de nueva clase permite escribir el nombre de una nueva clase y
      seleccionan los diagramas en los cuales esta nueva clase estara
      contenida. </p>
  <p class="TextoNormal" align="left">Para
    especificar las propiedades de la nueva clase, haga clic en editar,
    aparece la ventana de especificaci&oacute;n de una clase.</p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><span class="TextoResaltado"><img src="../pluginObjetos/objetos009.png" height="192" width="370"></span></p>
    <p>Figura 7. Selecci&oacute;n de una clase plantilla para el interesado</p>
  </div>
  <p class="style2" align="left">Para m&aacute;s
    informaci&oacute;n sobre las especificaci&oacute;n de una clase nueva, vea <a href="../pluginClases/index.html">Diagrama de Clases</a>.</p>
  <p class="TextoNormal" align="left">Si
    se decide tomar una clase como plantilla para el objeto, se deber&aacute;
    especificar como se debe tomar la Fuente de Caracter&iacute;sticas, bien sea
    como clase, objeto o combinado. Como clase el objeto en el
diagrama tomar&aacute; los atributos y las operaciones de la clase
plantilla, mientras que como objeto solo generar&aacute; la
asociaci&oacute;n a ese tipo sin tomar sus atributos ni operaciones.&nbsp; </p>
  <div class="Imagen" style="text-align: center;">
    <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><span class="TextoNormal" style="text-align: center;"><img src="../pluginObjetos/objetos011.png" height="80" width="248"></span></p>
    <p>Figura 8. Fuente de caracter&iacute;sticas para el interesado</p>
  </div>
  <span class="TextoNormal"><br>
  </span><span class="TextoItalico">El Interesado</span><span class="TextoNormal"> reci&eacute;n creado permite generar desde los iconos de expansi&oacute;n notas de inter&eacute;s, tambi&eacute;n permite establecer generalizaciones desde este y hacia otros objetos interesados. <br>
  <br>
  El elemento Interesado luce como sigue: </span>
  <div class="TextoNormal" style="text-align: left;">
  <div class="Imagen" style="text-align: center;">
    <p><img src="interes07.png" width="98" height="95"></p>
    <p>Figura 8. Representaci&oacute;n de un interesado</p>
  </div>
<span class="TextoNormal" style="font-weight: bold;"> Notas de Inter&eacute;s:&nbsp;</span>Establezca el inter&eacute;s de los interesados mediante notas con texto editable </div>
<div class="Imagen" style="text-align: center;">
  <p><span class="TextoNormal"></span><span class="TextoNormal">&nbsp;</span><span class="TextoNormal"><img src="interes12.png" width="195" height="61"></span></p>
  <p>Figura 9. Notas de Inter&eacute;s</p>
</div>
<p class="TextoNormal">Para crear
      una nueva Nota de inter&eacute;s se hace clic sobre el icono &quot;Nota de Interes&quot; y arrastre una nueva nota desde un Interesado. Tambi&eacute;n puede hacerlo desde los iconos de expansi&oacute;n.</p>
<p><span class="TextoNormal"> Aparece una ventana donde podr&aacute; editar el texto de la nota de inter&eacute;s.</span><br class="TextoNormal">
</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="interes09.png" width="340" height="280"></p>
  <p>Figura 10. Creaci&oacute;n de Notas</p>
</div>
<br class="TextoNormal">
<span class="TextoNormal" style="font-weight: bold;">Generalizaci&oacute;n: </span><span class="TextoNormal">cree generalizaciones entre diversos interesados para representar las generalizaciones de las clases cuyos objetos instancian</span><br>
<br>
<div class="Imagen" style="text-align: center;">
  <p><img src="interes13.png" width="233" height="79"></p>
  <p>Figura 11. Creaci&oacute;n de una relaci&oacute;n de Generalizaci&oacute;n </p>
</div>
<span class="TextoNormal"><br>
</span>
<p class="TextoNormal" align="left">Para crear
  una nueva generalizaci&oacute;n se hace clic sobre el icono Generalizaci&oacute;n y
  luego se hace clic, primero sobre el Interesado m&aacute;s espec&iacute;fico  y despu&eacute;s
  se hace clic en el Interesado m&aacute;s general.</p>
<p class="TextoNormal" align="left">Aparece la
  ventana de especificaci&oacute;n de la relaci&oacute;n, desplegando
    la primera pesta&ntilde;a de texto en la que se escribe el nombre
    correspondiente al estereotipo de la relaci&oacute;n.</p>
<p class="TextoNormal" align="left">Tambi&eacute;n puede establezca generalizaciones desde los iconos de expansi&oacute;n del Interesado.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="interes08.png" width="108" height="164"></p>
  <p>Figura 12. Asociaci&oacute;n de interesados</p>
</div></td>
</tr>
</tbody>
</table>
</body></html>