<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><title>Plugin IFE</title>
<style type="text/css">
<!--
@import url("../estilo.css");
-->
</style>
</head>

<body topmargin="0">
<table align="center" border="0" height="95" width="478">
<tbody>
<tr>
<td height="23">
<p class="Estilo4" align="left">Plugin IFE</p></td>
</tr>
<tr>
<td height="66" width="472"><p class="TextoNormal"><br>
  IFE es un ambiente de seguimiento integrado para depurar c&oacute;digo de forma sencilla y con resultados que ayudar&aacute;n al programador a detectar las causas de un error.</p>
  <p class="TextoNormal">El plugin IFE utiliza el Framework Depurador,  que permitir mostrar el valor de las variables durante la ejecuci&oacute;n de c&oacute;digo en tiempo real. </p>
  <p class="TextoNormal" align="left"><span class="TextoResaltado">Creaci&oacute;n de un nuevo entorno de depuraci&oacute;n: </span>Para utilizar el Framework IFE debe crear un nuevo entorno mediante el Plugin IFE. Se selecciona en
    el Marco de Expresi&oacute;n: Nuevo, Ingeniero Cazador de Defectos, IFE.<br>
    <br>
Se ingresan
    los datos correspondientes al entorno. </p>
<p class="Imagen" align="center"><img src="IFE-0006.png" width="458" height="272" class="IMAGEN_CENTRADA"></p>
<p class="Imagen" align="center">Figura 1. Creaci&oacute;n de un entorno IFE</p>
<p class="TextoResaltado">Barra de
herramientas del Plugin Diagrama de Inter&eacute;s: </p>
<p class="TextoNormal">Esta barra ofrece las funcionalidades com&uacute;nes para el editor de c&oacute;digo.</p>
<p class="Imagen"><img src="IFE-0007.png" width="158" height="23"></p>
<p class="Imagen">Figura 2. Barra de herramientas del plugin</p>
<p class="TextoNormal"><span class="TextoResaltado">Nueva Clase:</span> Seleccione el icono Nuevo para crear una clase vac&iacute;a.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/nuevaclase.PNG" width="160" height="64"></p>
  <p>Figura 3. Creaci&oacute;n de nueva clase</p>
</div>
<p class="TextoNormal"> Escriba un nombre para  la nueva clase, dicho nombre ser&aacute; usado tambi&eacute;n para nombrar el archivo de c&oacute;digo fuente. Ej.  (Clase_Prueba.java), como se observa en la Figura 4.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/nombrarclase.PNG" width="170" height="112"></p>
  <p>Figura 4. Agregando nombre a la nueva clase</p>
</div>
<p class="TextoNormal"> Colosoft genera una nueva clase vac&iacute;a e inicia el editor de c&oacute;digo., como se observa en la Figura 5.<br>
</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/codigoinicial.PNG" width="276" height="155"></p>
  <p>Figura 5. Clase de prueba en el editor de c&oacute;digo</p>
</div>
<p class="TextoNormal"> Importar Archivos de C&oacute;digo: Seleccione el bot&oacute;n Importar. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/clicimportaar.PNG" width="182" height="60"></p>
  <p>Figura 6. Editando c&oacute;digo</p>
</div>
<p class="TextoNormal">Seguidamente se abrir&aacute; una ventada de selecci&oacute;n de archivos. <br>
  Importe archivos .java que contengan c&oacute;digo fuente. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/seleccionarjava.PNG" width="301" height="159"></p>
  <p>Figura 7. Archivo creado con la clase</p>
</div>
<p class="TextoNormal"> <span class="TextoResaltado">Editor: </span>edite o inserte c&oacute;digo a modo de texto, el editor de c&oacute;digo de Colosoft permite trabajar c&oacute;modamente sobre el c&oacute;digo resaltando con diferentes colores las palabras claves correspondientes al lenguaje de programaci&oacute;n.<br>
</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/resaltarcodigo.PNG" width="199" height="205"></p>
  <p>Figura 8. Coloreado de sintaxis y agrupaci&oacute;n de c&oacute;digo</p>
</div>
<p class="TextoNormal"> Colosoft tambi&eacute;n le permite resaltar m&oacute;dulos dentro del c&oacute;digo  mostrando llaves cuadradas al lado izquierdo del editor. </p>
<p class="TextoNormal"><span class="TextoResaltado" style="font-weight: bold;">Depuraci&oacute;n de C&oacute;digo :</span><span style="font-weight: bold;">&nbsp;</span>Para iniciar la depuraci&oacute;n de c&oacute;digo, haga clic sobre el bot&oacute;n Compilar ubicado en la esquina superior derecha del marco de expresi&oacute;n del Plugin IFE.  </p>
</p>
<p class="Imagen" align="left"><img src="IFE-0019.png" width="121" height="85"></p>
<p class="Imagen" align="left">Figura 9. Compilando el proyecto</p>
<span class="TextoNormal">En el Marco de Extensi&oacute;n bajo la pesta&ntilde;a &quot;Consola de Compilaci&oacute;n&quot; puede observar el resultado de la compilaci&oacute;n. Corrija todos los errores que aqu&iacute; se presenten antes de proceder con la depuraci&oacute;n. </span>
<p class="Imagen" align="left"><img src="IFE-0020.png" width="191" height="90"></p>
<p class="Imagen" align="left">Figura 10. Resultados de la compilaci&oacute;n</p>
<span class="TextoNormal">Asegurese de que su c&oacute;digo sea ejecutable para que el depurador pueda iniciarse correctamente.</span>
<p class="Imagen" align="left"><img src="IFE-0026.png" width="272" height="199"></p>
<p class="Imagen" align="left">Figura 11. Pruebas unitarias en depuraci&oacute;n</p>
<span class="TextoResaltado" style="font-weight: bold;">Break Point:</span><span style="font-weight: bold;">&nbsp;</span><span class="TextoNormal">Establezca puntos espec&iacute;ficos sobre los cuales desee interrumpir la ejecuci&oacute;n de c&oacute;digo para visualizar el valor de las variables presentes. Para agregar un Break Point haga clic al lado izquierdo de una l&iacute;nea de c&oacute;digo,  se visualizar&aacute; como un marcador rojo a la izquierda del numero de l&iacute;nea.</span>
<p class="Imagen" align="left"><img src="IFE-0027.png" width="167" height="34"></p>
<p class="Imagen" align="left">Figura 12. Creando un Break point</p>
<span class="TextoNormal">Establezca tantos marcadores como necesite tambi&eacute;n es posible ubicarlos en m&uacute;ltiples lugares del c&oacute;digo. </span>
<p class="Imagen" align="left"><img src="IFE-0028.png" width="291" height="367"></p>
<p class="Imagen" align="left">Figura 13. M&uacute;ltiples break points </p>
<span class="TextoResaltado" style="font-weight: bold;">Depurar:</span><span style="font-weight: bold;">&nbsp;</span><span class="TextoNormal">Con los puntos de Ruptura establecidos haga clic sobre el bot&oacute;n Depurar para iniciar el proceso de depuraci&oacute;n. </span>
<p class="Imagen" align="left"><img src="IFE-0029.png" width="192" height="72"></p>
<p class="Imagen" align="left">Figura 14. Bot&oacute;n de acceso a la depuraci&oacute;n</p>
<p><span class="TextoResaltado" style="font-weight: bold;">Control de Flujo  :</span><span style="font-weight: bold;">&nbsp;</span><span class="TextoNormal">Colosoft permite controlar el flujo de ejecuci&oacute;n de tres formas diferentes y teniendo en cuenta los puntos de ruptura. En la parte derecha del marco de Expresi&oacute;n encontrar&aacute; los botones correspondientes a cada tipo de control.</span></p>
<p><span class="TextoNormal" style="font-weight: bold;">Paso Dentro: </span><span class="TextoNormal">Utilice este control para revisar el estado de las variables haciendo una pausa en cada l&iacute;nea de ejecuci&oacute;n. Este control no tiene en cuenta los Puntos de Ruptura. </span></p>
<p><span class="TextoNormal" style="font-weight: bold;">Paso Sobre: </span><span class="TextoNormal">El c&oacute;digo es ejecutado sin realizar pausas hasta el primer Punto de Ruptura que se encuentre en el c&oacute;digo, a partir de la l&iacute;nea de c&oacute;digo. que este punto indique, Colosoft realizar&aacute; pausas sobre cada l&iacute;nea de c&oacute;digo. restante.</span></p>
<p><span class="TextoNormal" style="font-weight: bold;">Dar Salto : </span><span class="TextoNormal">El c&oacute;digo es ejecutado sin realizar pausas hasta el primer Punto de Ruptura que se encuentre en el c&oacute;digo, haciendos&eacute; saltos en el control de Flujo por cada Punto de ruptura. </span></p>
<p class="Imagen" align="left"><img src="IFE-0031.png" width="105" height="76">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="IFE-0032.png" width="92" height="85">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="IFE-0033.png" width="85" height="104"></p>
<p class="Imagen" align="left">Figura 15. Botones de control para la depuraci&oacute;n</p>
<span class="TextoNormal" style="font-weight: bold;">Visualizaci&oacute;n de variables: </span><span class="TextoNormal">Dentro del Marco de Extensi&oacute;n, bajo la pesta&ntilde;a Consola De Depuraci&oacute;n, Colosoft mostrar&aacute; el valor de cada variable y estructura utilizada, acorde con el punto de ruptura sobre el cual se sit&uacute;a el Flujo de Ejecuci&oacute;n. </span>
<p class="Imagen" align="left"><img src="IFE-0034.png" width="364" height="173"></p>
<p class="Imagen" align="left">Figura 16. Visualizaci&oacute;n de variables en depuraci&oacute;n</p>
<p class="TextoNormal"><span class="TextoResaltado">Guardar:</span> Guarde los cambios realizados en el c&oacute;digo editado sobre el archivo fuente de la clase que actualmente est&aacute; abierto. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/guardar.PNG" width="177" height="65">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>
  <p>Figura 17. Guardar c&oacute;digo</p>
</div>
<p class="TextoNormal"> <span class="TextoResaltado">Imprimir:</span> Imprima el c&oacute;digo fuente desde el editor de c&oacute;digo a su impresora, utilizando la opci&oacute;n Imprimir y el di&aacute;logo gen&eacute;rico de impresi&oacute;n.<br>
</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/imprimir.PNG" width="175" height="60">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>
  <p>Figura 18. Imprimir</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">Deshacer - Rehacer</span>: Deshaga cambios realizados en el c&oacute;digo mediante la opci&oacute;n Deshacer, y rehaga cambios previamente descartados mediante la opci&oacute;n Rehacer. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="../shoot_comun/redeshacer.PNG" width="204" height="57"></p>
  <p>Figura 19. Rehacer</p>
</div><p class="IMAGEN_CENTRADA" align="left">&nbsp;</p></td>
</tr>
</tbody>
</table>
</body></html>