<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><title>FRAMEWORK ISE</title>

<link rel="stylesheet" href="../estilo.css"></head>
<body topmargin="0">
<table align="center" border="0" height="95" width="478">
<tbody>
<tr>
<td height="23">
<p class="Titulo" align="left">Framework ISE</p></td>
</tr>
<tr>
<td height="66" width="472">
<p align="center" class="TextoNormal"><br>
  <span class="TextoNormal">El Ambiente Sem&aacute;ntico ISE (Integrated Semantic Environment, por sus siglas en ingl&eacute;s) es un Framework creado para facilitar al Ingeniero de An&aacute;lisis, Dise&ntilde;o, Desarrollo o de Pruebas, la definici&oacute;n, seguimiento y revisi&oacute;n de caracter&iacute;sticas que hacen m&aacute;s robusto y entendible el c&oacute;digo fuente. Integra las herramientas: Editor de C&oacute;digo, Compilador y Consola sem&aacute;ntica.</span></p>
<div style="text-align: center;"> 
  <p class="Imagen"><img src="image000.png" width="455" height="471"></p>
  <p class="Imagen">Figura 1. Marco del ambiente sem&aacute;ntico ISE</p>
</div>
<p class="TextoNormal">En el Marco de Presentaci&oacute;n se muestra, en forma jer&aacute;rquica, la informaci&oacute;n relacionada con el proyecto actualmente abierto, a trav&eacute;s de un &aacute;rbol que se despliega para mostrar los archivos relacionados y los componentes del c&oacute;digo en edici&oacute;n.<br>
</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image001.png" width="262" height="171"></p>
  <p>Figura 2. Vista detallada del ambiente sem&aacute;ntico</p>
</div>
<p class="TextoNormal">Para expandir la Sem&aacute;ntica de la Clase, el Framework ISE insertar etiquetas especiales en el c&oacute;digo del editor. Dependiendo del tipo de etiqueta, esta captura informaci&oacute;n asociada a diferentes contextos de la clase como pueden ser: Nombre, Autor, Versi&oacute;n de la Clase, Tipo de Clase, patrones presentes utilizados, antipatrones identificados, condiciones y post condiciones etc. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image002.png" width="240" height="96"></p>
  <p>Figura 3. Anclas sem&aacute;nticas</p>
</div>
<p class="TextoNormal"><br>
  La FIgura 4 muestra las posibles etiquetas que pueden ser insertadas  en el c&oacute;digo.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="anclas.png" width="177" height="190">&nbsp;&nbsp;&nbsp;<img src="anclas2.png" width="184" height="178"></p>
  <p>Figura 4. Anclas sem&aacute;nticas en c&oacute;digo</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">Consola Sem&aacute;ntica:</span> Ubicada en el Marco de Extensi&oacute;n, permite expandir y documentar el c&oacute;digo fuente a la vez que muestra informaci&oacute;n resumida de la clase. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image003.png" width="482" height="205"></p>
  <p>Figura 5. Explorando las anclas sem&aacute;nticas en la consola sem&aacute;ntica</p>
</div>
<p>  <span class="TextoNormal">La consola sem&aacute;ntica est&aacute; compuesta por varias vistas especializadas en diferentes &aacute;mbitos: Las vistas incluidas dentro del framework son:</span></p>
<p class="TextoNormal"><span class="TextoResaltado">&bull;	Vista de autor&iacute;a:</span> Presenta Informaci&oacute;n asociada con el origen de la Clase: Autor Versi&oacute;n Fecha de Creaci&oacute;n:</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image004.png" width="321" height="283"></p>
  <p>Figura 6. Consola Sem&aacute;ntica</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">&bull;	Vista CRC:</span> Permite reconstruir una tarjeta CRC de la clase mostrando Responsabilidades y Colaboraciones.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image005.png" width="422" height="266"></p>
  <p>Figura 7. Vista CRC</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">&bull;	Vista de Tareas:</span> Describe tareas a realizar por los diferentes m&oacute;dulos de la clase. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image006.png" width="398" height="205"></p>
  <p>Figura 8. Vista de tareas</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">&bull;	Vista de Aserciones: </span>Resume las aserciones realizadas en toda la clase, Precondiciones, Invariantes y Post condiciones.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image007.png" width="431" height="194"></p>
  <p>Figura 9. Vista de asersiones</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">&bull;	Vista de Antipatrones:</span> Resume los antipatrones identificados en la clase. </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image008.png" width="381" height="194"></p>
  <p>Figura 10. Vista de antipatrones</p>
</div>
<p><span class="TextoNormal"><br>
</span><span class="TextoResaltado">&bull;	Vista de Patrones: </span><span class="TextoNormal"> Resume los patrones identificados en la clase con el ancla sem&aacute;ntica. La Figura 11 muestra la vista de patrones con un patr&oacute;n comando identificado.</span> </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image009.png" width="426" height="205"></p>
  <p>Figura 11. Vista de patrones</p>
</div>
<p><span class="TextoNormal"><br>
</span><span class="TextoResaltado">&bull;	Vista de M&eacute;tricas</span><span class="TextoNormal">: Resume las secciones de c&oacute;digo que realizan m&eacute;tricas de la clase.</span> </p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image010.png" width="400" height="204"></p>
  <p>FIgura 12. Vista de M&eacute;tricas</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">&bull;	Vista de Personalizaci&oacute;n:</span> Resume la Informaci&oacute;n contenida en anclas sem&aacute;nticas personalizadas, como se muestra en la Figura 13.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image012.png" width="461" height="205"></p>
  <p>Figura 13. Vista de personalizaci&oacute;n</p>
</div>
<p class="TextoNormal"><span class="TextoResaltado">Codificaci&oacute;n y Compilaci&oacute;n</span>: La compilaci&oacute;n y codificaci&oacute;n de c&oacute;digo se apoya en el Compilador y Editor de C&oacute;digo integrados en el ambiente. Para m&aacute;s informaci&oacute;n sobre estas dos caracter&iacute;sticas vea Framework IPE.</p>
<div class="Imagen" style="text-align: center;">
  <p><img src="image011.png" width="202" height="133"></p>
  <p>Figura 14. Compilaci&oacute;n y codificaci&oacute;n en el ambiente ISE</p>
</div>
<p class="TextoNormal">&nbsp;</p></td>
</tr>
</tbody>
</table>
</body></html>