<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><title>Framework Depurador</title>

<link rel="stylesheet" href="../estilo.css"></head>
<body topmargin="0">
<table align="center" border="0" height="95" width="478">
<tbody>
<tr>
<td height="23">
<p class="Estilo4" align="left">Framework Depurador </p>
</td>
</tr>
<tr>
<td class="TextoNormal" height="66" width="472"><p> <br>
  El Framework Depurador (FD)  es un framework dise&ntilde;ado para dar soporte a la edici&oacute;n de C&oacute;digo bajo el esquema de depuraci&oacute;n.  Este framework provee funciones de seguimiento de ejecuci&oacute;n de c&oacute;digo en tiempo real mediante puntos de parada y visualizaci&oacute;n en consola del valor de las variables.<br>
    </p>
  <div class="Imagen" style="text-align: center;">
    <p><img src="1.png" width="167" height="34"></p>
    <p>Figura 1. Variables en el Framework Depurador</p>
  </div>
  <p>    El depurador soporta la utilizaci&oacute;n de m&uacute;ltiples puntos de  parada, a la vez que soporta diferentes m&eacute;todos de navegaci&oacute;n a trav&eacute;s de estos. La Figura 2 muestra diferentes puntos de parada sobre multiples funciones en un escenario de depuraci&oacute;n.<br>
      </p>
  <div class="Imagen" style="text-align: center;">
    <p><img src="2.png" width="291" height="367"></p>
    <p>FIgura 2. Puntos de parada en el depurador</p>
  </div>
  <p>    El framework depurador permite recorrer todas las l&iacute;neas de c&oacute;digo (Paso Dentro), iniciar la depuraci&oacute;n desde el punto de parada m&aacute;s pr&oacute;ximo (Paso Sobre) o detener la ejecuci&oacute;n en cada punto de parada establecido.<br>
        </p>
  <div class="Imagen" style="text-align: center;">
    <p><img src="3.png" width="387" height="103"></p>
    <p>Figura 3. Pasos de Depuraci&oacute;n</p>
  </div>
  <p>    El Framework de Depuraci&oacute;n se integra en el marco de expresi&oacute;n del editor de c&oacute;digo y en la consola de depuraci&oacute;n en el  marco de extensi&oacute;n,  ademas es utilizado por varios Frameworks Derivados que integran su funcionalidad. La consola de depuraci&oacute;n muestra informaci&oacute;n relevante al tipo y nombre de cada variable utilizada por el programa en el punto de parada, como se muestra en la Figura 4.</p>
  <div class="Imagen" style="text-align: center;">
    <p><img src="4.png" width="364" height="173"></p>
    <p>Figura 4. Variables inspeccionadas para los puntos de parada</p>
    <p>&nbsp;</p>
  </div>
  <p><br>
        </p>
  <p></p>
  <p><br>
  </p></td>
</tr>
</tbody>
</table>
</body></html>